_posts/2016-10-15-different-strokes-for-different-folks.html
---
layout: post
title: Different strokes for different folks
excerpt: Companies approach technology differently--for good reason
---

<p>
A few months ago, I began working for <a href="https://www.fundingcircle.com/us/">Funding Circle</a>, an online marketplace for small business loans. It's been an interesting experience, but a big culture shock in terms of the company's approach to technology.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Two approaches to technology</h2>
<div class="outline-text-2" id="text-1">
<p>
My previous employer, <a href="http://www.epic.com/">Epic</a>, had some ideas about technology that I found hard to swallow. These include:
</p>

<ul class="org-ul">
<li>Be wary of tech trends
</li>
<li>Use as much <a href="https://www.techopedia.com/definition/3848/not-invented-here-syndrome-nihs">in-house technology</a> as possible
</li>
<li>Only get third-party technology when necessary, and only from <a href="https://www.microsoft.com/en-us/">large, trusted vendors</a>
</li>
<li>Avoid open-source technology
</li>
</ul>

<p>
Funding Circle takes a different approach:
</p>

<ul class="org-ul">
<li>Embrace cutting-edge ideas
</li>
<li>Use open-source technologies
</li>
<li>Get third-party technology from <a href="http://www.confluent.io/">smaller</a> <a href="https://www.hashicorp.com/">companies</a> (unless it's <a href="https://aws.amazon.com/">infrastructure</a>&#x2026;)
</li>
</ul>

<p>
As with most things, there are advantages and disadvantages to both approaches.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Epic</h2>
<div class="outline-text-2" id="text-2">
<p>
Epic sells software and consulting services to medium and large healthcare organizations. This is a <a href="http://healthtechreality.com/we-buy-for-life/">long-term relationship</a>&#x2013;the time that it takes for an organization to "<a href="http://healthtechreality.com/roles-at-epic-implementers/">go live</a>" can be longer than the entire existence of a Bay Area start-up. The relationship will be particularly long-lived given Epic's utter dominance in this sector.
</p>

<p>
Epic itself has been around since 1979&#x2013;the same year that <a href="https://en.wikipedia.org/wiki/VisiCalc">VisiCalc</a> was released. The company and its technology have outlived many tech trends, and will no doubt outlive many more. Long after everyone has forgotten what a Docker container is, Epic's Caché-based backend will still be serving the world's largest hospitals.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Funding Circle</h2>
<div class="outline-text-2" id="text-3">
<p>
Funding Circle is competing in a relatively new space: a marketplace for small businesses to get loans online and investors to purchase those loans. The dust has not yet settled in this sector, so "move fast and break things" is a more feasible&#x2013;perhaps necessary&#x2013;approach.
</p>

<p>
The US operation, which was purchased by UK-based Funding Circle a few years ago, has already gone through two tech stacks&#x2013;first Excel<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>, then Ruby on Rails. Now we are moving to Clojure<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>, Kafka, micro-services, etc.&#x2013;exciting, but perhaps also ephemeral. How long before another tech stack switch? I doubt anyone knows.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Which approach do you prefer?</h2>
<div class="outline-text-2" id="text-4">
<p>
The approach to technology at a company are dictated by many factors, including the company's longevity, size, and culture.
</p>

<p>
The approach that a company takes no doubt works for that company, but as a developer, it's worth asking: which approach do you prefer? Would you want to work at an Epic-like company or a Funding Circle-like company?
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Like most <a href="https://www.youtube.com/watch?v=hKcOkWzj0_s">financial-sector companies</a>, it seems.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Which is why I'm here.
</p></div>


</div>
</div>
